cristianoag/esp32_clones/software/esp32_msx_emulator/lib/fmsx/tests/host_smoke.cpp
// Host lifecycle regression: executes synthetic Z80 code, not a copyrighted BIOS.
#include "../../../src/MsxCore.h"
#include "../../../src/MsxPlatform.h"
#include "../Esp32Port.h"
#include "MSX.h"
#include <cassert>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <unistd.h>
#include <string>
#include <vector>
#include <sys/stat.h>

extern "C" {
extern AY8910 PSG;
extern byte *ROMData[MAXSLOTS], *MemMap[4][4][8], *EmptyRAM, *RAM[8];
extern byte ROMType[MAXSLOTS], ROMMapper[MAXSLOTS][4], ROMMask[MAXSLOTS], SCCOn[2];
extern int NChunks;
}

static unsigned frames, audioSamples, nonzeroSamples, coloredFrames, errors, allocation;
static unsigned failAllocation;
static unsigned frameLimit = 3;
static bool realBios;
static bool basicPrompt;
static bool cartridgeTest;
static std::vector<byte> expectedCarts[2];
static int expectedMappers[2] = {-1, -1};
static byte expectedResults[2];
static char lastError[256];
static uint16_t sampledJoysticks;
static unsigned joystickPolls;
static unsigned keyboardPolls, requestedDrawPercent = 100;
static bool requestedPal;
static bool expectRealLogo, logoTest, expectLogo;
static bool logoResetTest;
static bool truncateOmegaOnAllocation;
static unsigned logoPcSamples, logoPixels, logoFrame;
static std::vector<byte> expectedLogo;
static std::vector<byte> expectedExtension;

static bool executingLogo()
{
  return CPU.PC.W >= 0x8000 && CPU.PC.W < 0xC000 &&
         MemMap[0][0][4] != EmptyRAM && RAM[CPU.PC.W >> 13] == MemMap[0][0][CPU.PC.W >> 13];
}

uint16_t msxPollJoysticks()
{
  // Exercise all combinations independently; disconnected ports also return zero.
  sampledJoysticks = realBios ? 0 : static_cast<uint16_t>(
      ((joystickPolls * 7) & 0x3f) | (((joystickPolls * 11 + 3) & 0x3f) << 8));
  ++joystickPolls;
  return sampledJoysticks;
}

static void checkJoystickPorts()
{
  assert(JOYTYPE(0) == JOY_STICK && JOYTYPE(1) == JOY_STICK);
  const byte savedRegister = PSG.Latch;
  const byte savedControl = PSG.R[15];
  for (unsigned port = 0; port < 2; ++port)
  {
    OutZ80(0xA0, 15);
    OutZ80(0xA1, static_cast<byte>(0x0f | (port << 6)));
    OutZ80(0xA0, 14);
    assert((InZ80(0xA2) & 0x3f) == ((~(sampledJoysticks >> (port * 8))) & 0x3f));
  }
  OutZ80(0xA0, 15);
  OutZ80(0xA1, savedControl);
  OutZ80(0xA0, savedRegister);
}

static void checkCartridges()
{
  for (int slot = 0; slot < 2; ++slot) {
    const word pc = CPU.PC.W;
    const int mode = Mode;
    const unsigned allocations = allocation;
    const unsigned errorCount = errors;
    char error[128] = "old error";
    assert(MsxValidateCartridge(ROMName[slot], error, sizeof(error)) && !error[0]);
    assert(!MsxValidateCartridge("relative.rom", error, sizeof(error)) && error[0]);
    assert(CPU.PC.W == pc && Mode == mode && allocation == allocations);
    assert(errors == errorCount && !ExitNow);
    if (RdZ80(0xC100 + slot) != expectedResults[slot])
      fprintf(stderr, "Slot %d: result=%02X expected=%02X PC=%04X PSL=%02X SSL3=%02X size=%zu mapper=%d\n",
              slot + 1, RdZ80(0xC100 + slot), expectedResults[slot], CPU.PC.W,
              PSLReg, SSLReg[3], expectedCarts[slot].size(), expectedMappers[slot]);
    assert(RdZ80(0xC100 + slot) == expectedResults[slot]);
    if (expectedCarts[slot].empty()) {
      assert(!ROMData[slot] && !ROMMask[slot] && !SCCOn[slot]);
      for (int bank = 0; bank < 8; ++bank)
        assert(MemMap[slot + 1][0][bank] == EmptyRAM);
      continue;
    }
    assert(ROMData[slot]);
    assert(memcmp(ROMData[slot], expectedCarts[slot].data(),
                  expectedCarts[slot].size()) == 0);
    assert(!SCCOn[slot]);
    const int mapper = expectedMappers[slot];
    if (mapper < 0) { assert(!ROMMask[slot]); continue; }
    assert(ROMType[slot] == mapper);
    assert(ROMMapper[slot][0] == 0 && ROMMapper[slot][1] == 1);
    assert(ROMMapper[slot][2] == 2 && ROMMapper[slot][3] == 3);
    OutZ80(0xA8, 0xC0 | ((slot + 1) * 0x14));
    const word registers[] = {0xA000,0x8000,0xB000,0xA000,0x7800,0x77FF,0xA000,0x7FF7};
    const bool wide = mapper == MAP_GEN16 || mapper == MAP_ASCII16 || mapper == MAP_FMPAC;
    const unsigned bank = expectedCarts[slot].size() / 8192 - 2;
    WrZ80(registers[mapper], wide ? bank / 2 : bank);
    const word address = mapper == MAP_FMPAC ? 0x4100 : wide ? 0x8100 : 0xA100;
    // GameMaster2 has a fixed 16-bank mask; its test image has 16 banks.
    assert(RdZ80(address) == expectedCarts[slot][bank * 8192 + 0x100]);
    if (mapper == MAP_KONAMI5) {
      WrZ80(0x9000, 0x3F);
      assert(SCCOn[slot]);
    }
  }
}

static void captureImage(const char* name, const uint8_t* pixels, int width, int height,
                         const uint32_t* palette)
{
  FILE* f = fopen(name, "wb");
  assert(f);
  fprintf(f, "P6\n%d %d\n255\n", width, height);
  for (int i = 0; i < width * height; ++i) {
    const uint32_t color = palette[pixels[i]];
    const unsigned char rgb[] = {
      static_cast<unsigned char>(color >> 16),
      static_cast<unsigned char>(color >> 8),
      static_cast<unsigned char>(color)
    };
    assert(fwrite(rgb, 1, sizeof(rgb), f) == sizeof(rgb));
  }
  fclose(f);
}

static void captureBoot(const uint8_t* pixels, int width, int height,
                        const uint32_t* palette)
{
  captureImage("boot.ppm", pixels, width, height, palette);
  printf("Final screen: mode=%u, PC=%04X, RAM=%d KiB\n", ScrMode, CPU.PC.W, RAMPages * 16);
  if (ScrMode == 0 || ScrMode == 1) {
    const int columns = ScrMode == 0 ? 40 : 32;
    for (int row = 0; row < 24; ++row) {
      char text[41];
      for (int col = 0; col < columns; ++col) {
        const unsigned char c = ChrTab[row * columns + col];
        text[col] = c >= 32 && c < 127 ? c : ' ';
      }
      text[columns] = 0;
      if (strstr(text, "Ok")) basicPrompt = true;
      printf("%s\n", text);
    }
  }
}

extern "C" void* heap_caps_malloc(size_t size, unsigned)
{
  if (++allocation == failAllocation) return nullptr;
  if (truncateOmegaOnAllocation && size == 32768) {
    // Simulate a short read after the loader has checked the bank's exact size.
    truncateOmegaOnAllocation = false;
    FILE* f = fopen("OMEGA.ROM", "wb");
    assert(f && fclose(f) == 0);
  }
  return malloc(size);
}
extern "C" void heap_caps_free(void* ptr) { free(ptr); }

